In [10]:
import pandas as pd
d ={ 'Name' : ['Harry','John','Mary','Charly'],
    'Age' : [25,35,26,30],
    'Place' : ['TVM','NYR','LON','SAN']}
ind={'a','b','c','d'}
print('DataFrame with custom index')
df= pd.DataFrame(d,ind)
df

DataFrame with custom index

     Name  Age Place
a   Harry   25   TVM
d    John   35   NYR
c    Mary   26   LON
b  Charly   30   SAN

In [12]:
print('Reset to Default Index')
df.reset_index(inplace=True)
df

Reset to Default Index

   level_0 index    Name  Age Place
0        0     a   Harry   25   TVM
1        1     d    John   35   NYR
2        2     c    Mary   26   LON
3        3     b  Charly   30   SAN